{
  "education": [
    {
      "awards_achievements": [
        "2020 Summer Scholarship - York University International Award of Merit"
      ],
      "degree": "Bachelor of Science with Honours, Computer Science",
      "department": "Lassonde School of Engineering",
      "duration": "2017-2022",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-xuanfuchen",
  "highlighted_projects": [
    {
      "description": "Developed a robust online blog system that enables administrators to perform CRUD operations on articles, tags, and types while logged in. Implemented a search feature that allows users to easily find articles by name, and a group feature that enables articles to be organized by type or tags for convenient browsing. Implemented a comment feature that enables users to leave comments on articles and reply to other comments. Built front-end pages using Semantic UI and Thymeleaf, and leveraged Spring Boot for a reliable and scalable backend solution. Designed a MySQL schema by carefully defining objects and relations to ensure data integrity.",
      "git_url": "https://github.com/xuanfuchen/BlogProject",
      "name": "Dynamic Blog Web Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed and implemented monitoring system that contains multiple scripts to monitor and store the system specification and system resource usage across multiple Linux hosts. Utilized Crontab to automate the execution of scripts to ensure that the data in the database is accurate and up-to-date, system resource usage will be fetched and stored into the database at an interval of 1 minute.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Developed a comprehensive SQL project that includes the setup of a table schema using DDL, and multiple queries to perform various operations on an existing database. These operations include basic CRUD functionality, JOIN statements to combine data from multiple tables, and the use of aggregation functions to extract and summarize data. Demonstrated knowledge of SQL by manipulating string format and using various features to generate desired outputs.",
      "git_url": "/sql",
      "name": "SQL Project"
    },
    {
      "description": [
        "Twitter App: In progress.",
        "JDBC App: Developed a Java 8 Maven-based application that uses the DAO (Data Access Object) design pattern and JDBC to perform basic CRUD (Create, Read, Update, Delete) operations on a PostgreSQL database. Enables users to perform common database operations efficiently. Employed the DAO design pattern to promote good coding practices and make the code more maintainable and extensible. Utilized a PostgreSQL database running inside a Docker container for easy deployment and management. Built the database schema and inserted data using SQL scripts.",
        "Grep App: In progress."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Xuanfu Chen",
  "others": [
    {
      "bullets": [
        "Casual Gaming - Enjoy playing single-player games with a focus on storytelling.",
        "Competitive gaming - Used to achieve the top 4 in the North America Division with a team of 15 players.",
        "Karting Racing - Top 2% in lap time in K1 Speed Karting, Toronto"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in an Agile/Scrum development environment and developed the product based on the agile framework guidelines. Collaborated with the development team to discuss and deliver software solutions to our customers. Gained valuable experience from working on various software development projects in a professional work setting. Worked with practical technologies that are used in the industry, such as CentOS, Docker, PostgreSQL, Java, Spring Boot, etc.",
      "duration": "Feb 2023 - present",
      "title": "Junior Software Developer"
    },
    {
      "company": "Poros Consulting",
      "description": "Developed a web application for visualizing information of top companies. Utilized Python libraries, including Request and BeautifulSoup, to fetch data from reliable financial webpages. Effectively using commercial finance APIs to get financial news related to top companies. Designed the MySQL database schema. Created maintainable components capable of updating data in MySQL databases on a daily basis. Realized data visualization using Echarts.js and implemented backend RESTful APIs using Django.",
      "duration": "Feb 2022 - Jul 2022",
      "title": "Software Developer Intern"
    },
    {
      "company": "INFINITE, Guangzhou, China",
      "description": "Contributed to the development of a job board website by building a key module. Designed and developed multiple RESTful APIs using Java to enable efficient communication between front-end and back-end systems. Boosted the efficiency of data retrieval by utilizing SQL to query the MySQL database and retrieve only the necessary data for front-end pages. Ensured high-quality code by utilizing JUnit for automated testing, resulting in approximately 70% test coverage and reliable functionality.",
      "duration": "Jun 2018 - Aug 2018",
      "title": "Java Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "HTML/CSS",
      "Javascript",
      "Docker",
      "Beautiful Soup",
      "MVC developing",
      "JUnit Test"
    ],
    "familiar": [
      "Amazon Web Services(AWS)",
      "Google Cloud Platform(GCP)",
      "Maven",
      "Echarts",
      "Nginx",
      "Tomcat"
    ],
    "proficient": [
      "Java",
      "Python",
      "Spring Boot",
      "Django",
      "Linux/Bash/Shell",
      "RDBMS/SQL(MySQL/PostgreSQL)",
      "Agile/Scrum",
      "Git/Github"
    ]
  },
  "summary": "I'm a recent graduate from York University with a bachelor's degree in computer science. I have a strong foundation in fundamental concepts like algorithms, data structures, and RDBMS. I had two internships before, both in full-stack development. In my first internship, I participated in the development of a job board website using HTML, CSS, AJAX, and Java Servlets for the back-end. In my second internship, I developed a data visualization application to visualize stock information for top companies using the Django framework. Also, I built a dynamic blog web application using Spring Boot where the blogger can use admin pages to manage the blogs. I have strong coding and problem-solving skills, as proven by my past experiences and personal projects. I have always been passionate about programming since I get a sense of achievement from optimizing code or fixing bugs. With my education and experience, I am well prepared for a junior software engineer position, and I am looking forward to starting my career in this industry full-time."
}
