{
  "education": [
    {
      "awards_achievements": [
        "2020 Summer Scholarship - York University International Award of Merit"
      ],
      "degree": "Bachelor of Science with Honours, Computer Science",
      "department": "Lassonde School of Engineering",
      "duration": "2017-2022",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-xuanfuchen",
  "highlighted_projects": [
    {
      "description": "Built an online blog system that allows the blog administrators to log in and out and perform CRUD operations on articles, tags, and types. Implemented the search feature, the group feature, and the comment feature that allow users to search articles by name, group articles by type or tags, and comment on articles or other comments. Designed and built front-end pages using Semantic UI and Thymeleaf. Implemented the backend using Spring Boot. Designed objects and relations for generating the MySQL schema.",
      "git_url": "https://github.com/xuanfuchen/BlogProject",
      "name": "Dynamic Blog Web Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed and implemented monitoring system that contains multiple scripts to monitor and store the system specification and system resource usage across multiple Linux hosts. Utilized Crontab to automate the execution of scripts to ensure that the data in the database is accurate and up-to-date, system resource usage will be fetched and stored into the database at an interval of 1 minute.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Used PostgreSQL commands to operate create/update/delete operations to an existing database. Implemented multiple SQL queries to get desired data from the database.",
      "git_url": "/sql",
      "name": "SQL Project"
    },
    {
      "description": [
        "Twitter App: In progress.",
        "JDBC App: In progress.",
        "Grep App: In progress."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Xuanfu Chen",
  "others": [
    {
      "bullets": [
        "Casual Gaming - Enjoy playing single-player games with a focus on storytelling.",
        "Competitive gaming - Used to achieve the top 4 in the North America Division with a team of 15 players.",
        "Karting Racing - Top 2% in lap time in K1 Speed Karting, Toronto"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in an Agile/Scrum development environment and developed the product based on the agile framework guidelines. Collaborated with the development team to discuss and deliver software solutions to our customers. Gained valuable experience from working on various software development projects in a professional work setting. Worked with practical technologies that are used in the industry, such as CentOS, Docker, PostgreSQL, Java, Spring Boot, etc.",
      "duration": "Feb 2023 - present",
      "title": "Junior Software Developer"
    },
    {
      "company": "Poros Consulting",
      "description": "Developed a web application for visualizing top companies?¡¥ information. Utilized Python libraries, including Request and BeautifulSoup, to fetch data from reliable financial webpages. Effectively using commercial finance APIs to get financial news related to top companies. Designed the MySQL database schema. Created maintainable components capable of updating data in MySQL databases on a daily basis. Realized data visualization using Echarts.js and implemented backend RESTful APIs using Django.",
      "duration": "Feb 2022 - Jul 2022",
      "title": "Software Developer Intern"
    },
    {
      "company": "INFINITE, Guangzhou, China",
      "description": "Developed a part of a job board website. Implemented multiple RESTful APIs using Java. Used HTML, CSS, and AJAX to develop multiple dynamic front-end pages for showing job details. Used SQL to query the MySQL database for the front-end page's desired data. Utilized JUnit for automated testing, test coverage is approximately 70%.",
      "duration": "Jun 2018 - Aug 2018",
      "title": "Java Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "HTML/CSS",
      "Javascript",
      "Docker",
      "Beautiful Soup",
      "MVC developing",
      "JUnit Test"
    ],
    "familiar": [
      "Amazon Web Services(AWS)",
      "Google Cloud Platform(GCP)",
      "Maven",
      "Echarts",
      "Nginx",
      "Tomcat"
    ],
    "proficient": [
      "Java",
      "Python",
      "Spring Boot",
      "Django",
      "Linux/Bash/Shell",
      "RDBMS/SQL(MySQL/PostgreSQL)",
      "Agile/Scrum",
      "Git/Github"
    ]
  },
  "summary": "I'm a recent graduate from York University with a bachelor's degree in computer science. I have a strong foundation in fundamental concepts like algorithms, data structures, and RDBMS. I had two internships before, both in full-stack development. In my first internship, I participated in the development of a job board website using HTML, CSS, AJAX, and Java Servlets for the back-end. In my second internship, I developed a data visualization application to visualize stock information for top companies using the Django framework. Also, I built a dynamic blog web application using Spring Boot where the blogger can use admin pages to manage the blogs. I have strong coding and problem-solving skills, as proven by my past experiences and personal projects. I have always been passionate about programming since I get a sense of achievement from optimizing code or fixing bugs. With my education and experience, I am well prepared for a junior software engineer position, and I am looking forward to starting my career in this industry full-time."
}
